from praktikum.ingredient_types import *

BUNS_LIST = [
        [("Флюоресцентная булка R2-D3", 988)],
        [("Краторная булка N-200i", 1255)],
        [
            ("Флюоресцентная булка R2-D3", 988),
            ("Краторная булка N-200i", 1255)
        ]
    ]

ADD_INGREDIENTS_DATA = [

    (INGREDIENT_TYPE_SAUCE, "Соус Spicy-X", 90),
    (INGREDIENT_TYPE_SAUCE, "Соус фирменный Space Sauce", 80),
    (INGREDIENT_TYPE_SAUCE, "Соус традиционный галактический", 15),
    (INGREDIENT_TYPE_SAUCE, "Соус с шипами Антарианского плоскоходца", 88),

    (INGREDIENT_TYPE_FILLING, "Мясо бессмертных моллюсков Protostomia", 1337),
    (INGREDIENT_TYPE_FILLING, "Говяжий метеорит (отбивная)", 3000),
    (INGREDIENT_TYPE_FILLING, "Биокотлета из марсианской Магнолии", 424),
    (INGREDIENT_TYPE_FILLING, "Филе Люминесцентного тетраодонтимформа", 988),
    (INGREDIENT_TYPE_FILLING, "Хрустящие минеральные кольца", 300),
    (INGREDIENT_TYPE_FILLING, "Плоды Фалленианского дерева", 874),
    (INGREDIENT_TYPE_FILLING, "Кристаллы марсианских альфа-сахаридов", 762),
    (INGREDIENT_TYPE_FILLING, "Мини-салат Экзо-Плантаго", 4400),
    (INGREDIENT_TYPE_FILLING, "Сыр с астероидной плесенью", 4142)
]

REMOVE_TEST_DATA = [
    (0, 2), 
    (-1, 2),  
    (2, 2)   
]


MOVE_TEST_DATA = [
    # (индекс, новый индекс, ожидаемый порядок)
    (1, 0, [1, 0, 2]),  # переместить второй ингредиент на первую позицию
    (-2, 0, [1, 0, 2]),  # проверить работу с отрицательными индексами
    # другие тестовые случаи
]

INVALID_MOVE_TEST_DATA = [

    (5, 1),  
    (-10, 1),  
    (1, 10),  
    (1, -10)  
]

VARIOUS_INGREDIENTS = [
        (60.0, [(100.0, "Начинка")], 2 * 60.0 + 100.0),  # 220.0

        # Один ингредиент — соус
        (60.0, [(80.0, "Соус")], 2 * 60.0 + 80.0),  # 200.0

        (70.0, [
            (150.0, "Начинка"),
            (80.0, "Соус")
        ], 2 * 70.0 + 150.0 + 80.0),  # 370.0

        (50.0, [
            (30.0, "Соус 1"),
            (120.0, "Начинка 1"),
            (40.0, "Специя")
        ], 2 * 50.0 + 30.0 + 120.0 + 40.0)  # 290.0
    ]

RECEIPT_DATA = [
            # Один ингредиент — соус
            (
                "Флюоресцентная булка R2-D3",
                [("SAUCE", "Соус фирменный Space Sauce")],
                220.0,
                [
                    "(==== Флюоресцентная булка R2-D3 ====)",
                    "= sauce Соус фирменный Space Sauce =",
                    "(==== Флюоресцентная булка R2-D3 ====)\n",
                    "Price: 220.0"
                ]
            ),
            # Один ингредиент — начинка
            (
                "Краторная булка N-200i",
                [("FILLING", "Филе Люминесцентного тетраодонтимформа")],
                320.0,
                [
                    "(==== Краторная булка N-200i ====)",
                    "= filling Филе Люминесцентного тетраодонтимформа =",
                    "(==== Краторная булка N-200i ====)\n",
                    "Price: 320.0"
                ]
            ),
            # Несколько ингредиентов разных типов
            (
                "Булка Стандарт",
                [
                    ("SAUCE", "Соус острый"),
                    ("FILLING", "Котлета из антиматерии"),
                    ("SAUCE", "Соус сладкий")
                ],
                450.0,
                [
                    "(==== Булка Стандарт ====)",
                    "= sauce Соус острый =",
                    "= filling Котлета из антиматерии =",
                    "= sauce Соус сладкий =",
                    "(==== Булка Стандарт ====)\n",
                    "Price: 450.0"
                ]
            )
        ]